[
  {
    "year": -700,
    "question": "Vua Hùng thành lập nhà nước Văn Lang, đóng đô ở Phong Châu (Phú Thọ ngày nay). [7, 23, 29]"
  },
  {
    "year": -500,
    "question": "Văn minh lúa nước và văn hóa Đông Sơn phát triển rực rỡ, với biểu tượng trống đồng Đông Sơn. [23, 29, 34]"
  },
  {
    "year": -258,
    "question": "Thục Phán (An Dương Vương) sáp nhập Văn Lang và Âu Việt, lập ra nước Âu Lạc, xây thành Cổ Loa. [4, 5, 6, 7, 21, 33, 35]"
  },
  {
    "year": -218,
    "question": "Bắt đầu cuộc Chiến tranh Tần-Việt. [7, 8]"
  },
  {
    "year": -207,
    "question": "Kết thúc Chiến tranh Tần-Việt. [7, 8]"
  },
  {
    "year": -179,
    "question": "Triệu Đà thôn tính Âu Lạc, thành lập nước Nam Việt, mở đầu thời kỳ Bắc thuộc thứ nhất theo một số quan điểm. [2, 5, 6, 18, 24]"
  },
  {
    "year": -111,
    "question": "Nhà Hán thôn tính Nam Việt, chính thức áp đặt ách đô hộ lên lãnh thổ Việt Nam. [2, 6, 18, 20, 24]"
  },
  {
    "year": 39,
    "question": "Khởi nghĩa Hai Bà Trưng bùng nổ chống lại ách đô hộ của nhà Đông Hán. [2, 6, 18]"
  },
  {
    "year": 40,
    "question": "Trưng Trắc lên ngôi vua (Trưng Nữ Vương), đóng đô ở Mê Linh. [2, 6, 18, 20, 27]"
  },
  {
    "year": 43,
    "question": "Mã Viện chỉ huy quân Hán đàn áp và dập tắt cuộc khởi nghĩa Hai Bà Trưng. [2, 3, 6, 18]"
  },
  {
    "year": 248,
    "question": "Khởi nghĩa Bà Triệu (Triệu Thị Trinh) chống lại quân Đông Ngô. [2, 6, 18]"
  },
  {
    "year": 542,
    "question": "Lý Bí khởi binh chống lại chính quyền nhà Lương. [2, 3, 6, 14, 18]"
  },
  {
    "year": 544,
    "question": "Lý Bí xưng đế (Lý Nam Đế), thành lập nước Vạn Xuân. [2, 3, 6, 18]"
  },
  {
    "year": 545,
    "question": "Nhà Lương cử quân sang đánh Vạn Xuân, Lý Nam Đế thua trận. [5, 18]"
  },
  {
    "year": 550,
    "question": "Triệu Quang Phục đánh đuổi quân Lương, bảo vệ Vạn Xuân và xưng Triệu Việt Vương. [5, 6, 18]"
  },
  {
    "year": 571,
    "question": "Lý Phật Tử cướp ngôi Triệu Việt Vương, tiếp tục giữ nền độc lập cho người Việt. [5, 6, 18]"
  },
  {
    "year": 602,
    "question": "Nhà Tùy đánh chiếm Vạn Xuân, kết thúc nền độc lập ngắn ngủi của Việt Nam. [2, 5, 18]"
  },
  {
    "year": 722,
    "question": "Khởi nghĩa Mai Thúc Loan (Mai Hắc Đế) chống lại ách đô hộ của nhà Đường. [2, 18]"
  },
  {
    "year": 791,
    "question": "Khởi nghĩa Phùng Hưng (Bố Cái Đại Vương) chống lại nhà Đường. [2, 14, 18]"
  },
  {
    "year": 905,
    "question": "Khúc Thừa Dụ chiếm thành Đại La, bắt đầu thời kỳ tự chủ của họ Khúc. [2, 18, 25]"
  },
  {
    "year": 930,
    "question": "Khúc Thừa Mỹ bị quân Nam Hán đánh bại, quyền tự chủ bị mất. [5, 18]"
  },
  {
    "year": 931,
    "question": "Dương Đình Nghệ đánh bại quân Nam Hán, giành lại quyền tự chủ. [18]"
  },
  {
    "year": 938,
    "question": "Ngô Quyền đại phá quân Nam Hán trên sông Bạch Đằng, chấm dứt hơn 1000 năm Bắc thuộc. [4, 5, 6, 11, 18, 23, 24]"
  },
  {
    "year": 939,
    "question": "Ngô Quyền xưng vương, thành lập nhà Ngô, đóng đô ở Cổ Loa. [5, 6, 15]"
  },
  {
    "year": 944,
    "question": "Dương Tam Kha cướp ngôi nhà Ngô. [6]"
  },
  {
    "year": 950,
    "question": "Ngô Xương Văn lật đổ Dương Tam Kha, giành lại ngôi vua cho nhà Ngô. [6]"
  },
  {
    "year": 965,
    "question": "Loạn 12 sứ quân bùng nổ sau khi nhà Ngô tan rã. [6, 15]"
  },
  {
    "year": 968,
    "question": "Đinh Bộ Lĩnh dẹp loạn 12 sứ quân, xưng đế (Đinh Tiên Hoàng), đặt tên nước là Đại Cồ Việt, đóng đô ở Hoa Lư. [5, 6, 15, 23]"
  },
  {
    "year": 979,
    "question": "Đinh Tiên Hoàng bị Đỗ Thích ám sát. [6]"
  },
  {
    "year": 980,
    "question": "Lê Hoàn (Lê Đại Hành) lên ngôi vua, lập ra nhà Tiền Lê. [5, 6]"
  },
  {
    "year": 981,
    "question": "Lê Hoàn chỉ huy quân dân đánh tan quân Tống xâm lược lần thứ nhất."
  },
  {
    "year": 1005,
    "question": "Lê Đại Hành qua đời."
  },
  {
    "year": 1009,
    "question": "Lý Công Uẩn (Lý Thái Tổ) lên ngôi vua, lập ra nhà Lý."
  },
  {
    "year": 1010,
    "question": "Lý Thái Tổ dời đô từ Hoa Lư về Đại La, đổi tên thành Thăng Long. [6]"
  },
  {
    "year": 1042,
    "question": "Ban hành bộ Hình thư - bộ luật thành văn đầu tiên của Việt Nam."
  },
  {
    "year": 1054,
    "question": "Vua Lý Thánh Tông đổi tên nước thành Đại Việt."
  },
  {
    "year": 1070,
    "question": "Vua Lý Thánh Tông cho lập Văn Miếu – Quốc Tử Giám."
  },
  {
    "year": 1075,
    "question": "Lý Thường Kiệt chủ động tấn công sang đất Tống (chiến dịch Ung Liêm Khâm)."
  },
  {
    "year": 1077,
    "question": "Lý Thường Kiệt chỉ huy đánh tan quân Tống lần thứ hai trên sông Như Nguyệt."
  },
  {
    "year": 1127,
    "question": "Vua Lý Nhân Tông qua đời, Lý Thần Tông lên ngôi."
  },
  {
    "year": 1174,
    "question": "Quân Trịnh chiếm được Phú Xuân, bắt đầu quản lý Thuận Hóa. [6]"
  },
  {
    "year": 1226,
    "question": "Trần Thủ Độ phế truất Lý Chiêu Hoàng, lập Trần Cảnh lên ngôi, nhà Trần thành lập."
  },
  {
    "year": 1232,
    "question": "Nhà Trần tổ chức thi Thái học sinh, mở đầu các kỳ thi Nho học chính thức."
  },
  {
    "year": 1241,
    "question": "Trần Hưng Đạo (Trần Quốc Tuấn) ra đời."
  },
  {
    "year": 1258,
    "question": "Quân dân Đại Việt dưới sự lãnh đạo của nhà Trần đánh tan quân Nguyên Mông lần thứ nhất. [6, 15]"
  },
  {
    "year": 1285,
    "question": "Quân dân Đại Việt đánh tan quân Nguyên Mông lần thứ hai. [6, 15]"
  },
  {
    "year": 1288,
    "question": "Quân dân Đại Việt đánh tan quân Nguyên Mông lần thứ ba trên sông Bạch Đằng. [6, 15]"
  },
  {
    "year": 1293,
    "question": "Trần Anh Tông lên ngôi, mở ra thời kỳ thái bình thịnh trị. [6]"
  },
  {
    "year": 1300,
    "question": "Trần Hưng Đạo qua đời."
  },
  {
    "year": 1306,
    "question": "Công chúa Huyền Trân kết hôn với vua Chăm Pa Chế Mân."
  },
  {
    "year": 1314,
    "question": "Trần Minh Tông lên ngôi. [6]"
  },
  {
    "year": 1329,
    "question": "Trần Hiến Tông lên ngôi. [6]"
  },
  {
    "year": 1341,
    "question": "Trần Dụ Tông lên ngôi, chính sự bắt đầu đổ nát. [6]"
  },
  {
    "year": 1371,
    "question": "Trần Nghệ Tông lên ngôi."
  },
  {
    "year": 1397,
    "question": "Hồ Quý Ly cho xây dựng thành Tây Đô (Thành nhà Hồ)."
  },
  {
    "year": 1399,
    "question": "Hồ Quý Ly ép Trần Thuận Tông nhường ngôi cho con."
  },
  {
    "year": 1400,
    "question": "Hồ Quý Ly cướp ngôi nhà Trần, lập ra nhà Hồ, đổi tên nước thành Đại Ngu."
  },
  {
    "year": 1406,
    "question": "Giấy Thông Bảo hội sao được ban hành, tiền giấy đầu tiên ở Việt Nam."
  },
  {
    "year": 1407,
    "question": "Nhà Minh xâm lược Đại Ngu, nhà Hồ sụp đổ, Việt Nam rơi vào thời kỳ Bắc thuộc lần thứ tư. [2, 14]"
  },
  {
    "year": 1418,
    "question": "Lê Lợi phất cờ khởi nghĩa Lam Sơn chống quân Minh. [14]"
  },
  {
    "year": 1427,
    "question": "Khởi nghĩa Lam Sơn đại thắng, Vương Thông xin rút quân về nước."
  },
  {
    "year": 1428,
    "question": "Lê Lợi lên ngôi hoàng đế (Lê Thái Tổ), lập ra nhà Lê sơ, ban bố Bình Ngô Đại Cáo. [16]"
  },
  {
    "year": 1433,
    "question": "Lê Thái Tổ (Lê Lợi) qua đời."
  },
  {
    "year": 1437,
    "question": "Nguyễn Trãi bị tru di tam tộc (vụ án Lệ Chi Viên)."
  },
  {
    "year": 1460,
    "question": "Lê Thánh Tông lên ngôi, mở đầu thời kỳ hưng thịnh của nhà Lê sơ."
  },
  {
    "year": 1471,
    "question": "Lê Thánh Tông chinh phạt Chiêm Thành."
  },
  {
    "year": 1483,
    "question": "Ban hành bộ Quốc triều hình luật (Luật Hồng Đức)."
  },
  {
    "year": 1488,
    "question": "Bản đồ Đại Việt được hoàn thành dưới thời Lê Thánh Tông."
  },
  {
    "year": 1527,
    "question": "Mạc Đăng Dung cướp ngôi nhà Lê, lập ra nhà Mạc."
  },
  {
    "year": 1529,
    "question": "Mạc Đăng Dung nhường ngôi cho con là Mạc Đăng Doanh."
  },
  {
    "year": 1533,
    "question": "Nguyễn Kim lập Lê Duy Ninh lên ngôi, phục hưng nhà Lê, mở đầu cục diện Nam Bắc triều."
  },
  {
    "year": 1548,
    "question": "Trịnh Kiểm bắt đầu nắm quyền binh. [20]"
  },
  {
    "year": 1558,
    "question": "Nguyễn Hoàng vào trấn thủ Thuận Hóa, mở đầu cho sự hình thành chúa Nguyễn ở Đàng Trong. [20]"
  },
  {
    "year": 1592,
    "question": "Trịnh Tùng đánh bại nhà Mạc, vua Lê trở lại Thăng Long."
  },
  {
    "year": 1593,
    "question": "Trịnh Tùng rước vua Lê Thế Tông về Thăng Long, đánh bại tàn dư nhà Mạc."
  },
  {
    "year": 1600,
    "question": "Nguyễn Hoàng chính thức ly khai triều đình Lê-Trịnh, xây dựng cơ sở Đàng Trong."
  },
  {
    "year": 1627,
    "question": "Bắt đầu Trịnh - Nguyễn phân tranh, lấy sông Gianh làm ranh giới. [11, 20]"
  },
  {
    "year": 1672,
    "question": "Cuộc chiến tranh Trịnh - Nguyễn chấm dứt tạm thời. [20]"
  },
  {
    "year": 1673,
    "question": "Khai thác mỏ đồng Tụ Long (Cao Bằng) dưới thời Lê-Trịnh."
  },
  {
    "year": 1771,
    "question": "Anh em Nguyễn Nhạc, Nguyễn Lữ, Nguyễn Huệ phất cờ khởi nghĩa Tây Sơn. [6]"
  },
  {
    "year": 1777,
    "question": "Quân Tây Sơn lật đổ chúa Nguyễn ở Đàng Trong."
  },
  {
    "year": 1778,
    "question": "Nguyễn Nhạc xưng hoàng đế, lập ra triều đại Tây Sơn. [6]"
  },
  {
    "year": 1782,
    "question": "Loạn kiêu binh ở Thăng Long, Trịnh Khải bị giết. [20]"
  },
  {
    "year": 1784,
    "question": "Nguyễn Ánh cầu viện Xiêm La, Nguyễn Huệ đánh tan quân Xiêm ở Rạch Gầm – Xoài Mút. [6]"
  },
  {
    "year": 1786,
    "question": "Nguyễn Huệ tiến quân ra Bắc, lật đổ chúa Trịnh, khôi phục quyền lực cho nhà Lê. [6]"
  },
  {
    "year": 1788,
    "question": "Lê Chiêu Thống cầu viện nhà Thanh, quân Thanh xâm lược Đại Việt. [6]"
  },
  {
    "year": 1789,
    "question": "Nguyễn Huệ lên ngôi hoàng đế Quang Trung, đại phá quân Thanh trong trận Ngọc Hồi – Đống Đa. [6]"
  },
  {
    "year": 1792,
    "question": "Quang Trung Hoàng đế qua đời."
  },
  {
    "year": 1802,
    "question": "Nguyễn Ánh lật đổ nhà Tây Sơn, lên ngôi hoàng đế Gia Long, lập ra nhà Nguyễn, đặt quốc hiệu là Việt Nam. [17]"
  },
  {
    "year": 1806,
    "question": "Quốc hiệu được đổi thành Đại Việt."
  },
  {
    "year": 1820,
    "question": "Minh Mạng lên ngôi hoàng đế. [17]"
  },
  {
    "year": 1831,
    "question": "Hoàng đế Minh Mạng thực hiện cải cách hành chính, chia cả nước thành 30 tỉnh và một phủ Thừa Thiên."
  },
  {
    "year": 1840,
    "question": "Vua Minh Mạng qua đời. [17]"
  },
  {
    "year": 1841,
    "question": "Thiệu Trị lên ngôi hoàng đế. [17]"
  },
  {
    "year": 1847,
    "question": "Tự Đức lên ngôi hoàng đế. [17]"
  },
  {
    "year": 1858,
    "question": "Thực dân Pháp nổ súng tấn công Đà Nẵng, mở đầu cuộc xâm lược Việt Nam. [4, 11, 12, 17]"
  },
  {
    "year": 1859,
    "question": "Trương Định tổ chức nghĩa quân chống Pháp ở Gò Công, Gia Định. [12]"
  },
  {
    "year": 1861,
    "question": "Nguyễn Trung Trực đốt cháy tàu Espérance của Pháp trên sông Vàm Cỏ Đông. [12]"
  },
  {
    "year": 1862,
    "question": "Triều đình Huế ký hòa ước Nhâm Tuất, nhượng 3 tỉnh miền Đông Nam Kỳ cho Pháp. [17]"
  },
  {
    "year": 1864,
    "question": "Trương Định tuẫn tiết sau khi bị quân Pháp bao vây. [12]"
  },
  {
    "year": 1867,
    "question": "Pháp chiếm 3 tỉnh miền Tây Nam Kỳ, hoàn tất việc chiếm đóng Nam Kỳ. [17]"
  },
  {
    "year": 1868,
    "question": "Nguyễn Trung Trực bị Pháp bắt và hành hình. [12]"
  },
  {
    "year": 1873,
    "question": "Pháp đánh chiếm Hà Nội lần thứ nhất. [17]"
  },
  {
    "year": 1883,
    "question": "Pháp đánh chiếm Hà Nội lần thứ hai."
  },
  {
    "year": 1883,
    "question": "Vua Tự Đức qua đời. [17]"
  },
  {
    "year": 1883,
    "question": "Vua Dục Đức lên ngôi 3 ngày thì bị phế truất. [17]"
  },
  {
    "year": 1883,
    "question": "Vua Hiệp Hòa lên ngôi và bị phế truất sau 4 tháng. [17]"
  },
  {
    "year": 1883,
    "question": "Vua Kiến Phúc lên ngôi. [17]"
  },
  {
    "year": 1884,
    "question": "Triều đình Huế ký Hiệp ước Patenôtre, chính thức công nhận quyền bảo hộ của Pháp đối với Việt Nam. [17]"
  },
  {
    "year": 1884,
    "question": "Vua Kiến Phúc qua đời. [17]"
  },
  {
    "year": 1884,
    "question": "Vua Hàm Nghi lên ngôi. [17]"
  },
  {
    "year": 1885,
    "question": "Chiếu Cần Vương được ban ra, phong trào Cần Vương bùng nổ hưởng ứng lời kêu gọi kháng chiến của vua Hàm Nghi. [13, 16]"
  },
  {
    "year": 1885,
    "question": "Vua Hàm Nghi bị Pháp bắt và đày sang Algeria. [13, 17]"
  },
  {
    "year": 1885,
    "question": "Vua Đồng Khánh lên ngôi. [17]"
  },
  {
    "year": 1886,
    "question": "Khởi nghĩa Ba Đình do Đinh Công Tráng lãnh đạo. [12, 13, 16]"
  },
  {
    "year": 1888,
    "question": "Vua Đồng Khánh qua đời. [17]"
  },
  {
    "year": 1889,
    "question": "Vua Thành Thái lên ngôi. [17]"
  },
  {
    "year": 1889,
    "question": "Khởi nghĩa Bãi Sậy do Nguyễn Thiện Thuật lãnh đạo chấm dứt. [12, 16]"
  },
  {
    "year": 1896,
    "question": "Khởi nghĩa Hương Khê của Phan Đình Phùng thất bại, đánh dấu chấm dứt phong trào Cần Vương. [13]"
  },
  {
    "year": 1904,
    "question": "Phan Bội Châu thành lập Hội Duy Tân. [22]"
  },
  {
    "year": 1907,
    "question": "Phong trào Đông Kinh Nghĩa Thục phát triển mạnh mẽ."
  },
  {
    "year": 1907,
    "question": "Vua Thành Thái bị Pháp phế truất. [17]"
  },
  {
    "year": 1907,
    "question": "Vua Duy Tân lên ngôi. [17]"
  },
  {
    "year": 1911,
    "question": "Nguyễn Tất Thành (Hồ Chí Minh) ra đi tìm đường cứu nước từ bến cảng Nhà Rồng. [22, 26]"
  },
  {
    "year": 1912,
    "question": "Nguyễn Ái Quốc thành lập Việt Nam Quang phục hội. [22]"
  },
  {
    "year": 1913,
    "question": "Khởi nghĩa Yên Thế của Hoàng Hoa Thám chấm dứt. [12, 13, 16, 22]"
  },
  {
    "year": 1914,
    "question": "Khoảng 100.000 người Việt bị ép sang châu Âu chiến đấu cho Pháp trong Chiến tranh thế giới thứ nhất. [7]"
  },
  {
    "year": 1916,
    "question": "Vua Duy Tân bị Pháp bắt và đày. [17]"
  },
  {
    "year": 1916,
    "question": "Vua Khải Định lên ngôi. [17]"
  },
  {
    "year": 1917,
    "question": "Khởi nghĩa Thái Nguyên. [7]"
  },
  {
    "year": 1919,
    "question": "Nguyễn Ái Quốc gửi Yêu sách của nhân dân An Nam tới Hội nghị Hòa bình Versailles. [7, 22, 26]"
  },
  {
    "year": 1920,
    "question": "Nguyễn Ái Quốc đọc bản Sơ thảo lần thứ nhất những luận cương về vấn đề dân tộc và thuộc địa của Lenin. [22]"
  },
  {
    "year": 1925,
    "question": "Cuộc bãi công của công nhân Ba Son. [22]"
  },
  {
    "year": 1925,
    "question": "Hội Việt Nam Cách mạng Thanh niên ra đời. [22]"
  },
  {
    "year": 1925,
    "question": "Vua Khải Định qua đời. [17]"
  },
  {
    "year": 1926,
    "question": "Vua Bảo Đại lên ngôi. [17]"
  },
  {
    "year": 1927,
    "question": "Nguyễn Thái Học thành lập Việt Nam Quốc dân Đảng."
  },
  {
    "year": 1929,
    "question": "Ba tổ chức cộng sản ra đời: Đông Dương Cộng sản Đảng, An Nam Cộng sản Đảng, Đông Dương Cộng sản Liên đoàn. [22]"
  },
  {
    "year": 1930,
    "question": "Hội nghị hợp nhất các tổ chức cộng sản, thành lập Đảng Cộng sản Việt Nam. [7, 11, 22]"
  },
  {
    "year": 1930,
    "question": "Phong trào Xô Viết Nghệ Tĩnh bùng nổ. [7, 13]"
  },
  {
    "year": 1940,
    "question": "Nhật Bản tiến vào Đông Dương."
  },
  {
    "year": 1940,
    "question": "Khởi nghĩa Bắc Sơn. [13]"
  },
  {
    "year": 1941,
    "question": "Nguyễn Ái Quốc về nước, thành lập Mặt trận Việt Minh."
  },
  {
    "year": 1944,
    "question": "Thành lập Đội Việt Nam Tuyên truyền Giải phóng quân (tiền thân Quân đội Nhân dân Việt Nam). [22]"
  },
  {
    "year": 1945,
    "question": "Nhật đảo chính Pháp ở Đông Dương."
  },
  {
    "year": 1945,
    "question": "Tổng khởi nghĩa Cách mạng tháng Tám thắng lợi trên toàn quốc. [11, 16]"
  },
  {
    "year": 1945,
    "question": "Khởi nghĩa giành chính quyền ở Hà Nội. [16]"
  },
  {
    "year": 1945,
    "question": "Hồ Chí Minh chủ trì cuộc họp Thường vụ Trung ương Đảng, chuẩn bị Tuyên ngôn Độc lập. [16]"
  },
  {
    "year": 1945,
    "question": "Vua Bảo Đại thoái vị, chấm dứt chế độ phong kiến ở Việt Nam. [17]"
  },
  {
    "year": 1945,
    "question": "Hồ Chí Minh đọc Tuyên ngôn Độc lập tại Quảng trường Ba Đình, khai sinh nước Việt Nam Dân chủ Cộng hòa. [16]"
  },
  {
    "year": 1946,
    "question": "Pháp trở lại xâm lược Việt Nam, bắt đầu cuộc kháng chiến chống Pháp. [5, 11]"
  },
  {
    "year": 1946,
    "question": "Chủ tịch Hồ Chí Minh ra Lời kêu gọi toàn quốc kháng chiến."
  },
  {
    "year": 1950,
    "question": "Chiến dịch Biên giới Thu-Đông thắng lợi."
  },
  {
    "year": 1953,
    "question": "Chính phủ Pháp cử tướng Henri Navarre làm Tổng chỉ huy quân đội viễn chinh Pháp ở Đông Dương. [26]"
  },
  {
    "year": 1953,
    "question": "Bộ Chính trị Trung ương Đảng họp và đề ra kế hoạch tác chiến đông xuân 1953-1954. [26]"
  },
  {
    "year": 1953,
    "question": "Navarre quyết định xây dựng Điện Biên Phủ thành tập đoàn cứ điểm mạnh. [26]"
  },
  {
    "year": 1953,
    "question": "Quân ta tấn công địch ở Lai Châu, bao vây uy hiếp Điện Biên Phủ. [26]"
  },
  {
    "year": 1954,
    "question": "Chiến thắng Điện Biên Phủ lừng lẫy năm châu, chấn động địa cầu. [10, 11, 19, 22]"
  },
  {
    "year": 1954,
    "question": "Hiệp định Genève được ký kết, Việt Nam tạm thời chia cắt thành hai miền. [11]"
  },
  {
    "year": 1955,
    "question": "Chiến tranh Việt Nam (hay Chiến tranh Đông Dương lần thứ hai) bắt đầu. [5, 30]"
  },
  {
    "year": 1957,
    "question": "Thành lập Trường Đại học Tổng hợp Hà Nội."
  },
  {
    "year": 1959,
    "question": "Con đường Hồ Chí Minh trên biển được mở để chi viện cho miền Nam."
  },
  {
    "year": 1960,
    "question": "Đại hội Đảng lần thứ III, đề ra đường lối cách mạng xã hội chủ nghĩa ở miền Bắc và cách mạng dân tộc dân chủ ở miền Nam."
  },
  {
    "year": 1964,
    "question": "Sự kiện Vịnh Bắc Bộ."
  },
  {
    "year": 1965,
    "question": "Chiến thắng Vạn Tường, mở đầu cao trào Tìm Mỹ mà đánh, lùng ngụy mà diệt. [26]"
  },
  {
    "year": 1965,
    "question": "Quân và dân miền Nam đánh bại cuộc phản công mùa khô lần thứ nhất của Mỹ. [26]"
  },
  {
    "year": 1965,
    "question": "Miền Bắc bắt đầu chống chiến tranh phá hoại lần thứ nhất của Mỹ. [26]"
  },
  {
    "year": 1966,
    "question": "Quân và dân miền Nam đánh bại cuộc phản công mùa khô lần thứ hai của Mỹ. [26]"
  },
  {
    "year": 1968,
    "question": "Cuộc Tổng tiến công và nổi dậy Xuân Mậu Thân. [26]"
  },
  {
    "year": 1968,
    "question": "Mỹ ngừng ném bom miền Bắc Việt Nam (sau Tết Mậu Thân)."
  },
  {
    "year": 1969,
    "question": "Chủ tịch Hồ Chí Minh qua đời."
  },
  {
    "year": 1969,
    "question": "Chính phủ Cách mạng lâm thời Cộng hòa miền Nam Việt Nam ra đời. [26]"
  },
  {
    "year": 1970,
    "question": "Việt Nam Dân chủ Cộng hòa thiết lập quan hệ ngoại giao với Vương quốc Thụy Điển (quốc gia phương Tây đầu tiên)."
  },
  {
    "year": 1972,
    "question": "Chiến dịch Điện Biên Phủ trên không."
  },
  {
    "year": 1973,
    "question": "Hiệp định Paris về chấm dứt chiến tranh, lập lại hòa bình ở Việt Nam được ký kết. [10, 30]"
  },
  {
    "year": 1975,
    "question": "Chiến dịch Hồ Chí Minh toàn thắng, giải phóng hoàn toàn miền Nam, thống nhất đất nước. [9, 10, 11, 19, 30]"
  },
  {
    "year": 1976,
    "question": "Cuộc Tổng tuyển cử bầu Quốc hội khóa VI, Quốc hội chung của cả nước đầu tiên sau thống nhất. [9, 26]"
  },
  {
    "year": 1976,
    "question": "Quốc hội khóa VI quyết định đặt tên nước là Cộng hòa xã hội chủ nghĩa Việt Nam. [9, 30]"
  },
  {
    "year": 1977,
    "question": "Việt Nam chính thức gia nhập Liên Hợp Quốc. [9]"
  },
  {
    "year": 1979,
    "question": "Chiến tranh biên giới phía Bắc giữa Việt Nam và Trung Quốc."
  },
  {
    "year": 1979,
    "question": "Việt Nam đánh thắng ngoại xâm bảo vệ chủ quyền biên giới Tây Nam và biên giới phía Bắc. [9]"
  },
  {
    "year": 1980,
    "question": "Hiến pháp mới của Cộng hòa xã hội chủ nghĩa Việt Nam được ban hành. [9]"
  },
  {
    "year": 1980,
    "question": "Phi công Phạm Tuân là người Việt Nam đầu tiên bay vào vũ trụ. [9]"
  },
  {
    "year": 1982,
    "question": "Đại hội V của Đảng Cộng sản Việt Nam, tiếp tục đường lối kiên trì xây dựng chủ nghĩa xã hội. [9]"
  },
  {
    "year": 1986,
    "question": "Đại hội VI của Đảng Cộng sản Việt Nam khởi xướng công cuộc Đổi mới toàn diện đất nước. [9, 11, 31]"
  },
  {
    "year": 1986,
    "question": "Khai thác tấn dầu thô đầu tiên từ mỏ Bạch Hổ của liên doanh Vietsovpetro. [9]"
  },
  {
    "year": 1987,
    "question": "Luật Đầu tư nước ngoài đầu tiên được ban hành, mở cửa thu hút FDI. [9]"
  },
  {
    "year": 1988,
    "question": "Khoán 10 trong nông nghiệp được ban hành, thay đổi diện mạo kinh tế nông thôn. [9]"
  },
  {
    "year": 1989,
    "question": "Việt Nam chấm dứt tình trạng siêu lạm phát. [9]"
  },
  {
    "year": 1991,
    "question": "Bình thường hóa quan hệ với Trung Quốc. [9]"
  },
  {
    "year": 1991,
    "question": "Việt Nam tham gia Hiệp định Paris về Campuchia."
  },
  {
    "year": 1992,
    "question": "Ban hành Hiến pháp mới, khẳng định kinh tế thị trường định hướng xã hội chủ nghĩa. [9]"
  },
  {
    "year": 1993,
    "question": "Ngân hàng Thế giới (WB) và Quỹ Tiền tệ Quốc tế (IMF) nối lại quan hệ với Việt Nam. [9]"
  },
  {
    "year": 1994,
    "question": "Đường dây 500kV Bắc-Nam mạch 1 chính thức đóng điện, lần đầu tiên kết nối hệ thống điện quốc gia. [9]"
  },
  {
    "year": 1994,
    "question": "Khánh thành Nhà máy Thủy điện Hòa Bình. [9]"
  },
  {
    "year": 1994,
    "question": "Mở cửa đón khách du lịch quốc tế."
  },
  {
    "year": 1995,
    "question": "Việt Nam gia nhập ASEAN. [9]"
  },
  {
    "year": 1995,
    "question": "Việt Nam và Hoa Kỳ bình thường hóa quan hệ ngoại giao."
  },
  {
    "year": 1996,
    "question": "Đại hội VIII của Đảng, tiếp tục đẩy mạnh công nghiệp hóa, hiện đại hóa."
  },
  {
    "year": 1997,
    "question": "Việt Nam gia nhập Diễn đàn Hợp tác Kinh tế châu Á – Thái Bình Dương (APEC)."
  },
  {
    "year": 1997,
    "question": "Thủ tướng Phan Văn Khải thăm Mỹ, mở ra giai đoạn mới trong quan hệ Việt-Mỹ."
  },
  {
    "year": 1998,
    "question": "Hà Nội đăng cai Đại hội Thể thao Đông Nam Á (SEA Games 22)."
  },
  {
    "year": 2000,
    "question": "Việt Nam và Hoa Kỳ ký Hiệp định Thương mại song phương (BTA)."
  },
  {
    "year": 2003,
    "question": "Việt Nam tổ chức SEA Games 22."
  },
  {
    "year": 2005,
    "question": "Việt Nam đăng cai Hội nghị Thượng đỉnh ASEM 5."
  },
  {
    "year": 2007,
    "question": "Việt Nam chính thức trở thành thành viên của Tổ chức Thương mại Thế giới (WTO)."
  },
  {
    "year": 2008,
    "question": "Việt Nam trở thành ủy viên không thường trực Hội đồng Bảo an Liên Hợp Quốc."
  },
  {
    "year": 2010,
    "question": "Hà Nội kỷ niệm 1000 năm Thăng Long."
  },
  {
    "year": 2011,
    "question": "Hội nghị cấp cao ASEAN lần thứ 18 được tổ chức tại Hà Nội."
  },
  {
    "year": 2012,
    "question": "Vịnh Hạ Long được công nhận là Kỳ quan thiên nhiên mới của thế giới."
  },
  {
    "year": 2013,
    "question": "Hiến pháp 2013 được Quốc hội thông qua."
  },
  {
    "year": 2015,
    "question": "Việt Nam ký kết Hiệp định Đối tác xuyên Thái Bình Dương (TPP)."
  },
  {
    "year": 2017,
    "question": "Việt Nam đăng cai Hội nghị cấp cao APEC tại Đà Nẵng."
  },
  {
    "year": 2018,
    "question": "Đội tuyển U23 Việt Nam vào chung kết giải U23 châu Á. [9]"
  },
  {
    "year": 2018,
    "question": "Hiệp định CPTPP chính thức có hiệu lực đối với Việt Nam. [9]"
  },
  {
    "year": 2019,
    "question": "Việt Nam trúng cử Ủy viên không thường trực Hội đồng Bảo an Liên Hợp Quốc nhiệm kỳ 2020-2021. [9]"
  },
  {
    "year": 2020,
    "question": "Việt Nam là Chủ tịch luân phiên của ASEAN."
  },
  {
    "year": 2020,
    "question": "Việt Nam là Ủy viên không thường trực Hội đồng Bảo an Liên Hợp Quốc."
  },
  {
    "year": 2021,
    "question": "Đại hội XIII của Đảng đề ra mục tiêu đến 2045 Việt Nam trở thành nước phát triển. [9]"
  }
]